app/controllers/api/v1/investors_controller.rb

SELECT "investors".* FROM "investors"
---
  def index
    @investors = Investor.all