app/controllers/api/v1/loans_controller.rb

  def index
    @loans = Loan.all
---
SELECT "loans".* FROM "loans"