app/controllers/api/v1/pools_controller.rb

SELECT "loans"."id" FROM "loans" WHERE "loans"."pool_id" = ?  [["pool_id", 4]]
INSERT INTO "pools" ("investor_id", "pool_amount", "created_at", "updated_at", "name", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["investor_id", 2], ["pool_amount", 1], ["created_at", "2019-07-29 19:26:25.117174"], ["updated_at", "2019-07-29 19:26:25.117174"], ["name", "Big One"], ["user_id", 1]]
UPDATE "pools" SET "pool_amount" = ?, "updated_at" = ? WHERE "pools"."id" = ?  [["pool_amount", 600], ["updated_at", "2019-08-01 13:49:06.961307"], ["id", 4]]
---
  def create
    @pool = Pool.new(pool_params)
    # @investor = Investor.find_by(id: @pool.investor_id)
    @loans = params[:loans].map do |loan|
      # loan[:attributes]
      loan[:id]
        end

    @loans.reject!{ |loan| loan.nil? || loan.empty? }

    @pool.loans = Loan.find(@loans.uniq)
    if @pool.save

SELECT "loans"."id" FROM "loans" WHERE "loans"."pool_id" = ?  [["pool_id", 4]]
UPDATE "pools" SET "pool_amount" = ?, "updated_at" = ? WHERE "pools"."id" = ?  [["pool_amount", 600], ["updated_at", "2019-08-01 13:49:06.961307"], ["id", 4]]
---
  def update
    @loans = params[:loans].map do |loan|
              loan[:id]
            end
    @loans.reject!{ |loan| loan.nil? || loan.empty? }
    @pool.loans = Loan.find(@loans.uniq)
    if @pool.update(pool_params)

DELETE FROM "pools" WHERE "pools"."id" = ?  [["id", 6]]
---
  def destroy
    if @pool.destroy

SELECT  "pools".* FROM "pools" WHERE "pools"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
    def set_pool
      @pool = Pool.find(params[:id])