app/controllers/api/v1/pools_controller.rb

  def create
    @pool = current_user.pools.build(pool_params)
    @investor = Investor.find_or_create_by(name: Investor.name)
---
INSERT INTO "investors" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Investor"], ["created_at", "2019-07-29 19:15:41.790058"], ["updated_at", "2019-07-29 19:15:41.790058"]]
SELECT  "investors".* FROM "investors" WHERE "investors"."name" = ? LIMIT ?  [["name", "Investor"], ["LIMIT", 1]]

    def set_pool
      @pool = Pool.find(params[:id])
---
SELECT  "pools".* FROM "pools" WHERE "pools"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]