app/controllers/investors_controller.rb

  def index
    @investors = Investor.all
---
SELECT "investors".* FROM "investors"